/*
Напиши программу, которая выводит на экран надпись: "Амиго очень умный".
Требования:
•	Программа должна выводить текст.
•	Текст должен начинаться с "Амиго".
•	Текст должен заканчиваться на "умный".
•	Текст должен состоять из 17 символов, включая пробелы.
•	Выводимый текст должен соответствовать заданию.
*/

package com.javarush.tasks.tasks01.task01;

public class Solution 
{
    public static void main(String[] args) 
    {
        // выводим фразу "Амиго очень умный" на экран, кавычки выведены не будут
        System.out.print("Амиго очень умный");
    }
}
