/*
Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.
Требования:
•	В программе должен использоваться вывод на экран.
•	Выведенный год должен состоять из 4 цифр.
•	Выведенный год должен начинаться с "31".
•	Выведенный год должен соответствовать заданию.
*/

package com.javarush.tasks.tasks01.task05;

public class Solution 
{
    public static void main(String[] args) 
    {
        int a = 3126;
        System.out.println(a - 8);
    }
}
