/*
Перед тобой 5 общеизвестных величин.
Перепиши их в более читаемый формат — экспоненциальный. Мантиcса должна представлять собой дробное число от 1.0 до 10.
После изменения формата чисел реальное значение, хранимое в переменной, не должно измениться.
Пример:
109.1678 — обычная форма;
1.091678E+2 — экспонентная форма записи.
Требования:
•	Существующим переменным должны присваиваться значения, записанные в экспонентном виде.
•	Значением мантисы должно быть дробное число от 1.0 до 10.
•	Реальное значение переменных не должно измениться.
*/

package com.javarush.task.pro.task07.task0704;

/* 
Экспонентная запись числа
*/

public class Solution {
    double earthDiameter = 1.2742E+4; //12742.0
    double lightSpeed = 2.99792458E+8; //299792458.0
    double uraniumAtomicMass = 2.380289E+2; //238.0289
    double averageBeeWeight = 8.5E-2; //0.085
    double javaDeveloperSalary = 1.E+4; //10000.0
}
