/*
Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
Этим переменным присвой максимально возможное для них значение.
Никаких методов создавать не нужно.
Требования:
•	В классе Solution должны быть созданы переменные всех примитивных целочисленных типов.
•	Всем целочисленным переменным должно быть присвоено максимально возможное для них значение.
•	В классе Solution не должно быть создано никаких методов.
*/

package com.javarush.task.pro.task07.task0702;

/* 
Максимальное целое
*/

public class Solution {
    byte number1 = Byte.MAX_VALUE;
    short number2 = Short.MAX_VALUE;
    int number3 = Integer.MAX_VALUE;
    long number4 = Long.MAX_VALUE;
}
